; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 8992)
	(= (fuel plane1) 2787)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 10)
	(at plane2 city3)
	(= (capacity plane2) 5941)
	(= (fuel plane2) 698)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city3)
	(= (capacity plane3) 2496)
	(= (fuel plane3) 994)
	(= (slow-burn plane3) 1)
	(= (fast-burn plane3) 3)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at person1 city0)
	(at person2 city0)
	(at person3 city2)
	(at person4 city1)
	(at person5 city3)
	(at person6 city2)
	(at person7 city3)
	(at person8 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 520)
	(= (distance city0 city2) 610)
	(= (distance city0 city3) 654)
	(= (distance city1 city0) 520)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 581)
	(= (distance city1 city3) 871)
	(= (distance city2 city0) 610)
	(= (distance city2 city1) 581)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 647)
	(= (distance city3 city0) 654)
	(= (distance city3 city1) 871)
	(= (distance city3 city2) 647)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city1)
	(at person2 city0)
	(at person3 city0)
	(at person4 city1)
	(at person5 city3)
	(at person6 city3)
	(at person7 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (fly plane1 city2 city3)
   deleted: (at plane1 city2)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 1941, (fuel plane1) from 2787 to 846
   goals met: 4 of 8
2. (board person7 plane3 city3)
   deleted: (at person7 city3)
   added: (in person7 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 4 of 8
3. (fly plane3 city3 city0)
   deleted: (at plane3 city3)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 1941 to 2595, (fuel plane3) from 994 to 340
   goals met: 4 of 8
4. (refuel plane3 city0)
   changed: (fuel plane3) from 340 to 2496
   goals met: 4 of 8
5. (board person1 plane3 city0)
   deleted: (at person1 city0)
   added: (in person1 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 4 of 8
6. (zoom plane3 city0 city1)
   deleted: (at plane3 city0)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 2595 to 4155, (fuel plane3) from 2496 to 936
   goals met: 4 of 8
7. (debark person1 plane3 city1)
   deleted: (in person1 plane3)
   added: (at person1 city1)
   changed: (onboard plane3) from 2 to 1
   goals met: 5 of 8
8. (debark person7 plane3 city1)
   deleted: (in person7 plane3)
   added: (at person7 city1)
   changed: (onboard plane3) from 1 to 0
   goals met: 6 of 8
9. (fly plane3 city1 city3)
   deleted: (at plane3 city1)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 4155 to 5026, (fuel plane3) from 936 to 65
   goals met: 6 of 8
10. (refuel plane2 city3)
   changed: (fuel plane2) from 698 to 5941
   goals met: 6 of 8
11. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 5026 to 6320, (fuel plane2) from 5941 to 4647
   goals met: 6 of 8
12. (board person3 plane2 city2)
   deleted: (at person3 city2)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 6 of 8
13. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 6 of 8
14. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 6320 to 7540, (fuel plane2) from 4647 to 3427
   goals met: 6 of 8
15. (debark person3 plane2 city0)
   deleted: (in person3 plane2)
   added: (at person3 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 7 of 8
16. (fly plane2 city0 city3)
   deleted: (at plane2 city0)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 7540 to 8848, (fuel plane2) from 3427 to 2119
   goals met: 7 of 8
17. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 8
